---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.Dispose
source: html/548fdf1f-76fc-367d-27ae-2ef3d9cd7550.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.Dispose Method

Releases all resources used by the AnalysisDisplayColorEntry

## Syntax (C#)
```csharp
public void Dispose()
```